===
String
===

x = "string";

---

(source_file
  (statement
    (identifier)
    (string)))


===
Binary
===

y = 1 + x;

---

(source_file
  (statement
    (identifier)
    (binexp (int) (binop) (identifier))))


===
Function / Call
===

f = fn(x, y) {
  z = x + y;
  k = 5 * z;
  k
};
g = fn(x) {
  v = f(5);
  v ? 2 : 3
};
z = g();
---

(source_file
  (statement
    (identifier)
    (func
      (params (identifier) (identifier))
      (def
        (statement
          (identifier)
          (binexp (identifier) (binop) (identifier)))
        (statement
          (identifier)
          (binexp (int) (binop) (identifier)))
        (identifier)
      )))
  (statement
    (identifier)
    (func
      (params (identifier))
      (def
        (statement
          (identifier)
          (call (identifier) (args (int))))
        (cond
          (identifier)
          (int)
          (int)))))
  (statement
    (identifier)
    (call (identifier))))


===
Nested
===

c = [1] < fn() [99];
-(-c)();

fib = fn(n) n < 3 ? 1 : fib(n-1) + fib(n-2);
---

(source_file
  (statement
    (identifier)
    (binexp
      (array (int))
      (binop)
      (func (def (array (int))))))
  (exp
    (unexp (unop)
      (call
        (paren (unexp (unop) (identifier))))))
  (statement
    (identifier)
    (func
      (params (identifier))
      (def
        (cond
          (binexp (identifier) (binop) (int))
          (int)
          (binexp
            (call
              (identifier)
              (args (binexp (identifier) (binop) (int))))
            (binop)
            (call
              (identifier)
              (args (binexp (identifier) (binop) (int))))))))))
